mengtrue/nRF52-24_Gzp/nRF52_ble_dfu_haptic/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}*/

static void leds_init(void)
{
    LEDS_CONFIGURE(BSP_LED_0_MASK);
    LEDS_OFF(BSP_LED_0_MASK);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
}

/*static void ble_dfu_evt_handler(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case BLE_DFU_EVT_INDICATION_DISABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is disabled\r\n");
            break;

        case BLE_DFU_EVT_INDICATION_ENABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is enabled\r\n");
            break;

        case BLE_DFU_EVT_ENTERING_BOOTLOADER:
            NRF_LOG_INFO("Device is entering bootloader mode!\r\n");
            break;
        default:
            NRF_LOG_INFO("Unknown event from ble_dfu\r\n");
            break;
    }
}*/

static void ble_haptic_evt_handler(ble_haptic_t * p_haptic, ble_haptic_evt_t * p_evt)
{
    switch (p_evt->type)
    {
			  case BLE_HAPTIC_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("Enable BLE Haptic service\r\n");
            /*NRF_POWER->GPREGRET = 1;
            NVIC_SystemReset();*/
            break;
        case BLE_HAPTIC_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("Disable BLE Haptic service\r\n");
            break;
        case BLE_HAPTIC_EVT_RUMBLE_SEND:
            NRF_LOG_INFO("BLE Haptic send rumble message\r\n");
            break;
        default:
            NRF_LOG_INFO("Unknown event from ble_haptic\r\n");
            break;
    }
}

static void ble_haptic_value_init()
{
    memset(ble_haptic_rumble_value, 0, BLE_HAPTIC_RUMBLE_LENGTH);
    ble_haptic_rumble_length = 0;
}

static void ble_haptic_rumble_data_handler(ble_haptic_t * p_haptic, uint8_t * p_data, uint16_t length)
{
	  NRF_LOG_INFO("receive ble rumble value, data : %x, length : %d\r\n", (uint32_t)p_data, length);
    ble_haptic_rumble_length = length;
    memcpy(ble_haptic_rumble_value, p_data, length);
    NRF_LOG_INFO("rumble value is %x, %x, %x, %x\n", (uint8_t)ble_haptic_rumble_value[0], (uint8_t)ble_haptic_rumble_value[1], (uint8_t)ble_haptic_rumble_value[2], (uint8_t)ble_haptic_rumble_value[3]) 

    spi_haptic_send(ble_haptic_rumble_value, ble_haptic_rumble_length);
    memset(ble_haptic_rumble_value, 0, BLE_HAPTIC_RUMBLE_LENGTH);
}

static void spi_haptic_event_handler(uint8_t * rx_buf, uint8_t length)
{
	  NRF_LOG_INFO("receive spi value, buf : %x, length : %d\r\n", (uint32_t)rx_buf, length);
}

		// test
		uint8_t test_spi_length = 10;
		uint8_t test_spi_tx[] = {0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0};

static void test()
{
    uint8_t i = 0;
    for (i = 0; i < test_spi_length; i++)
        test_spi_tx[i]++;
}

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    ble_haptic_value_init();

    timers_init();
    //buttons_leds_init(&erase_bonds);
    leds_init();
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Template started\r\n");
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
			  if (bleConnected == true && m_ble_haptics.conn_handler != BLE_CONN_HANDLE_INVALID)
        {
					  /*test();
            spi_haptic_send(test_spi_tx, test_spi_length);
            NRF_LOG_INFO("LED\r\n");
					  nrf_delay_ms(100);*/
        } else
        {
            LEDS_INVERT(BSP_LED_0_MASK);
					  NRF_LOG_INFO("no BT\r\n");
        }
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
				nrf_delay_ms(100);
    }
}


/**
 * @}
 */
